Autodesk.Revit.UI.Selection.ObjectType
This enumerated type contains object types allowed to be selected during selection operations.

Autodesk.Revit.UI.Selection.ObjectType.Subelement
Whole element or subelement.

Autodesk.Revit.UI.Selection.ObjectType.LinkedElement
Elements in linked RVT files.

Autodesk.Revit.UI.Selection.ObjectType.Face
Any face.

Autodesk.Revit.UI.Selection.ObjectType.Edge
Any model edge.

Autodesk.Revit.UI.Selection.ObjectType.PointOnElement
Any point on an element (on a face or curve).

Autodesk.Revit.UI.Selection.ObjectType.Element
Whole element.

Autodesk.Revit.UI.Selection.ObjectType.Nothing
Nothing.